---
kind: other
id: Properties.T:Autodesk.Revit.DB.TriangulatedShellComponent
source: html/d8452c63-3cb8-6451-def3-df908718e6bb.htm
---
# TriangulatedShellComponent Properties

True if and only if the triangulation represents a topologically closed shell
 (i.e., each edge is shared by two triangles).